<script setup>
import './index.css'
</script>

<template>
    <h1>Hey, I'm Shawn!</h1>
    <div>
        <div>
            <h1>// Stuff I do: </h1>
            <h2>println!("World-improving tools 🛠️");</h2>
            <h2>println!("Things to make life better 💡");</h2>
            <h2>println!("Talk a lot 🗣️");</h2>
            <h2>println!("Study tech all day 📖");</h2>
        </div>
        <div>
            <h1>// About me: </h1>
            <h2>println!("17yo who lives in Brazil 🇧🇷");</h2>
            <h2>println!("Junior developer 👨‍💻");</h2>
            <h2>println!("Love math ♾️");</h2>
            <h2>println!("Passionated about tech 🌐");</h2>
            <h2>println!("Want to explore the universe 🔭");</h2>
        </div>
        <div>
            <h1>// Work interests: </h1>
            <h2>println!("Math development 🔢");</h2>
            <h2>println!("IoT technology 📡");</h2>
            <h2>println!("Robotics 🤖");</h2>
            <h2>println!("Machine Learning 🧠");</h2>
            <h2>println!("Real-life applied stuff 🌐");</h2>
        </div>
    </div>
    <div>
        <h1>let github = String::from("github");</h1>
        <div>
            <h1>let email = String::from("shawnnectar@protonmail.com");</h1>
            <h1>let discord = String::from("ShawnNectar#8155");</h1>
        </div>
    </div>
    <div><h1>let brazil = String::from("<br/>⠀⠀⠀⠀⠀⠀⠀⠀⠀
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⢰⣿⣿⣿⣆⠀⣀⣀⣤⣴⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣶⣤⣀⡀⠀⠀⠀⠀<br/>
        ⠀⢠⣶⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣷⣦⡄⠀<br/>
        ⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡇⠀<br/>
        ⠀⠀⠈⠛⠉⠁⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠉⠙⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⡟⠁⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠇⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠟⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⢿⣿⣿⣿⣿⣿⣿⡿⠟⠁⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢿⣿⣿⡟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⣾⣿⣿⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠻⢿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀<br/>
        ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀");</h1></div>
</template>


